### Pandas 시작 - 파일을 DataFrame 로딩, 기본 API
* read_csv()
    * read_csv()를 이용하여 csv파일을 편리하게 DataFrame으로 로딩합니다
    * read_csv()의 sep인자를 콤마(,)가 아닌 다른 분리자로 변경하여 다른 유형의 파일도 로드가 가능합니다

In [2]:
import pandas as pd
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type : ', type(titanic_df))

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

### head(), tail()
* DataFrame의 맨 앞 일부 데이터만 추출합니다
* 괄호안에 아무것도 안쓰면 5개, 괄호안에 숫자를 쓰면 그 숫자만큼, .tail()은 맨 끝 5개, 괄호안에 숫자를 쓰면 그 숫자 만큼 출력됩니다
* tail도 head도 안쓰고, 데이터프레임 변수만 쓰고 실행 시 모든 데이터가 추출되는데, 중간에 (...)처리됨

In [5]:
# print 명령없이 변수 또는 데이터 프레임의 이름만 쓰면 아래와 같이 출력됩니다
titanic_df
# print를 안 썼을 때(장점) : 각 데이터들을 구분하기 좋은 출력형식이 적용됩니다
# print를 안 썼을 때(단점) : 한 개의 셀에 하나의 출력(마지막 출력)만 표시됩니다(다른 출력물이 있을 경우 지워짐)

10

In [7]:
# print를 썼을 때(장점) : 쓰여진 만큼 모든 출력이 화면에 표시됩니다
# print를 썼을 때(단점) : 출력양식에 꾸밈이 없어 보기에 좋지는 않습니다
print(a)
print(titanic_df)

10
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [9]:
titanic_df.head(3)
titanic_df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
print(titanic_df.head(3))
print(titanic_df.tail(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
     PassengerId  Survived  Pclass                                      Name  \
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

### info()
* 데이터 프레임의 메타정보를 볼 수 있는 함수
* 행 개수(index 개수), 인덱스 시작 끝 번호, 열 개수, 각 열의 데이터 형식 등등

In [11]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### DataFrame의 컬럼명과 인덱스

In [14]:
print("columns:", titanic_df.columns)
print("index:", titanic_df.index)
print("index value:", titanic_df.index.values)

columns: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
index: RangeIndex(start=0, stop=891, step=1)
index value: [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

### DataFrame에서 Series 추출 및 DataFrame 필터링 추출
* 필드명을 기준으로 다수의 값들로 이루어진 한 열의 데이터를 Series라고 부르며
* 이 Series들이 모여서 DataFrame을 구성한다

In [15]:
# DataFrame 객체에서 [ ] 연산자 내에 한 개의 컬럼만 입력하면 Series 객체를 반환
s = titanic_df['Name']
print(s.head(5))
print("## type:", type(s))

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object
## type: <class 'pandas.core.series.Series'>

In [16]:
# DataFrame객체에서 [ ] 연산자 내에 여러개의 컬럼명을 리스트로 입력하면
# 그 컬럼들로 구성된 DataFrame 반환
filtered_df = titanic_df[['Name','Age']]
print(filtered_df.head(5))
print("## type:", type(filtered_df))

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0
## type: <class 'pandas.core.frame.DataFrame'>

### ** shape **
DataFrame의 행(row)과 열(Column)의 크기를 갖고 있는 속성입니다.

In [17]:
print('DataFrame의 크기 : ', titanic_df.shape)

DataFrame의 크기 :  (891, 12)

### describe()
* 데이터 값들의 평균, 표준편차, 4분위 분포도 를 제공합니다. 숫자형 컬럼들에 대해서 해당정보 등을 제공합니다
* 숫자 데이터만 골라서

In [51]:
titanic_df.describe(include="object")

,Name,Sex,Ticket,Cabin,Embarked,Age_2level,Age_3level,Age_4level
count,891,891,891,891,891,891,891,891
unique,891,2,681,148,3,2,3,4
top,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",male,1601,C000,S,Adult,Adult,성년
freq,1,577,7,687,646,808,768,712

* Passengerid : 탑승자 데이터 일련번호
* Survived : 생존여부(0:사망, 1:생존)
* Pclass : 티켓의 선실 등급, (1:일등석, 2:이등석, 3:3등석)
* Sex : 팁승자 성별
* Age : 탑승자 나이
* Sibsp : 같이 탑승한 형제자매 또는 배우자 인원 수
* Parch : 같이 탑승한 부모님 또는 어린이 인원 수
* Ticket : 티켓 번호
* Fare : 요금
* Cabin : 선실 번호
* Embarked : 중간 정착 항구( C:Cherbourg, Q:Queenstown, S:Southhampton )

### value_counts()
* 동일한 개별 데이터 값이 몇 건이 있는 지 정보를 제공
* 개별 데이터값의 분포도
* 주의할 점은 value_counts()는 Series객체에서만 호출될 수 있으므로 반드시 DataFrame을 단일 컬럼으로 입력하여 Series로 변환한 뒤 호출합니다

In [19]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print( type(value_counts))

3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>

#### sort values(by=정렬컬럼, ascending=True/False로 오름차순/내림차순으로 결정

In [23]:
df = titanic_df.sort_values(by='Name', ascending=True)
df.head()
# titanic_df.sort_values(by='Name', ascending=True).head()
# Name으로 오름차순 정렬 후 정렬결과 5개 출력

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.00,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.00,NaN,C

In [24]:
titanic_df[['Name','Age']].sort_values(by='Age').head()
# Name, Age 컬럼만 추출하고 Age로 오름차순 정렬

                                Name   Age
803  Thomas, Master. Assad Alexander  0.42
755        Hamalainen, Master. Viljo  0.67
644           Baclini, Miss. Eugenie  0.75
469    Baclini, Miss. Helene Barbara  0.75
78     Caldwell, Master. Alden Gates  0.83

In [25]:
titanic_df[['Name','Age','Pclass']].sort_values(by=['Pclass','Age'], ascending=[False,True]).head()
# 모든 행 Name, Age, Pclass 컬럼 추출, Pclass, Age 순으로 정렬

                                Name   Age  Pclass
803  Thomas, Master. Assad Alexander  0.42       3
469    Baclini, Miss. Helene Barbara  0.75       3
644           Baclini, Miss. Eugenie  0.75       3
164     Panula, Master. Eino Viljami  1.00       3
172     Johnson, Miss. Eleanor Ileen  1.00       3

### DataFrame의 컬럼 데이터 셋 Access
DataFrame의 컬럼 데이터 세트 생성과 수정은 [ ]연산자를 이용해 쉽게 할 수 있습니다. 새로운 컬럼에 값을 할당하려면 DataFrame[ ]내에 새로운 컬럼명을 입력하고 값을 할당해 주기만 하면 됩니다.

In [26]:
# 컬럼 Age_0을 생성하고 모든 행에 0값을 채움
titanic_df['Age_0']=0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [27]:
# 컬럼 Age에 10을 곱한 값을 Age_by_10이라는 새로운 컬럼에 저장
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0

In [28]:
# 컬럼 값으로 계산한 결과값을 기존 컬럼에 업데이트하려고 하면,
# 기본 컬럼 이름을 그대로 지정해서 대입합니다
titanic_df['Age_0'] = titanic_df['Age_0']+100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100,260.0

### DataFrame 데이터 삭제
* axis에 따른 삭제
    * axis = 0 행방향
    * axis = 1 열방향

In [29]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0

In [30]:
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0

* drop() 메서드는 구성요소 인자로 inplace가 있는데, 이것의 기본값은 False입니다
* drop() 메서드는 inplace옵션 기본값에 의해 삭제된 열의 결과를 리턴할 뿐 함수를 호출한 DataFrame원본은 변화없이 보호됩니다
* 원본까지 변형하려면 inplace에 True값으로 설정하여 넣어줍니다
* titanic_drop_df = titanic_df.drop('Age_0', axis=1, inplace=True)

In [31]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1, inplace=True)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0

In [32]:
print('#### before axis 0 drop ####')
titanic_df.head(5)

#### before axis 0 drop ####

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,350.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,350.0

In [33]:
titanic_df.drop([0,1,2], axis=0, inplace=True)
print('#### after axis 0 drop ####')
titanic_df.head(5)

#### after axis 0 drop ####

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,350.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,350.0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,540.0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,20.0

### Index 객체

In [34]:
# 원본 파일 재로딩
titanic_df = pd.read_csv('titanic_train.csv')
#Index 객체 추출
indexes = titanic_df.index
print(indexes)

RangeIndex(start=0, stop=891, step=1)

In [35]:
# Index는 리스트와 비슷한 구조를 갖는 1차원 데이터입니다
print( type( indexes.values ) )
print( type( indexes ) )  # object
print( indexes.values.shape )
print( indexes[:5].values )
print( indexes.values[:5] )

<class 'numpy.ndarray'>
<class 'pandas.core.indexes.range.RangeIndex'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]

In [37]:
# [ ]를 이용하여 임의로 Index의 값을 변경할 수는 없습니다
indexes[0] = 5

TypeError: Index does not support mutable operations

In [38]:
# DataFrame이나 Series 객체는 Index 객체를 포함하지만
# Series 객체에 연산 함수를 적용할 때 Index는 연산에서 제외됩니다
# Index는 오직 식별용으로만 사용됩니다
series_fair = titanic_df['Fare']
series_fair.head(5)

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [42]:
print('Fair Series max 값 : ', series_fair.max() )
print('Fair Series sum 값 : ', series_fair.sum() )
print('sum() Fair Series 값 : ', sum(series_fair) )
print('Fair Series + 3:\n',( series_fair + 3).head(3) )

Fair Series max 값 :  512.3292
Fair Series sum 값 :  28693.9493
sum() Fair Series 값 :  28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

* DataFrame 및 Series에 reset_index() 메서드를 수행하면 새롭게 인덱스를 연속 숫자 형으로 할당합니다
* 기존 인덱스는 'index'라는 새로운 컬럼명으로 추가 포함됩니다
* 기존 데이터의 조작이나 변형의 결과가 남아있는 데이터가 새로운 컬럼으로 추가됨으로써 기존데이터의 흔적을 새로운 연산에 참여시킬수 있는 장점이 있습니다

In [44]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
print(titanic_reset_df.shape)
titanic_reset_df.head(3)

(891, 13)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### 데이터 Selection 및 Filtering

#### DataFrame의 [ ] 연산자

넘파이에서 [ ]연산자는 행의 위치, 열의 위치, 슬라이싱 범위 등을 지정해 데이터를 가져올 수 있었습니다. 하지만 DataFrame 바로 뒤에 있는 '[ ]'안에 들어갈 수 있는 것은 컬럼명 문자(또는 컬럼 명의 리스트 객체), 또는 인덱스로 변환 가능한 표현식입니다.

In [46]:
titanic_df = pd.read_csv('titanic_train.csv')
print('단일 컬럼 추출')
print(titanic_df['Name'].head(3))

단일 컬럼 추출
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [47]:
print('여러 컬럼 추출')
print(titanic_df[['PassengerId','Name']].head(3))

여러 컬럼 추출
   PassengerId                                               Name
0            1                            Braund, Mr. Owen Harris
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3                             Heikkinen, Miss. Laina

In [52]:
# print('[ ] 안의 숫자 index는 KeyError 오류 발생 :\n', titanic_df[0])
# 데이터 프레임 이름 옆에 [ ]를 사용할 땐 인덱싱만 사용하지 못합니다
# 인덱스 값으로 필터링하기 위해서는 반드시 .iloc가 사용되어야 합니다
print('[ ] 안의 숫자 index는 KeyError 오류 발생 :\n', titanic_df.iloc[0])

[ ] 안의 숫자 index는 KeyError 오류 발생 :
 PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                             C000
Embarked                             S
Age_10                              32
Name_len                            23
Age_2level                       Adult
Age_3level                       Adult
Age_4level                          성년
탑승자수                               891
생존자수                               342
생존율(%)                         38.3838
Name: 0, dtype: object

In [49]:
# 위의 경우 iloc를 사용하지 않고 인덱스를 이용한 필터링을 하고자 한다면
# 슬라이싱을 이용한 필터링은 가능합니다
titanic_df[0:2]
# titanic_df.iloc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

#### 무엇보다도 위의 [ ]를 이용한 필터링의 최대 활용 방법은 불린 필터링으로 [ ] 안의 비교연산식을 사용하여 필터링하는 예가 가장 많이 사용됩니다

In [50]:
titanic_df[ titanic_df[ 'Pclass'] == 3 ].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

### DataFrame .ix[ ]연산자
* 명칭 기반과 위치 기반 인덱싱 모두를 제공하였으나 얼마전에 기능이 삭제됨
    * 대용으로 사용하고 있는 것이 .loc[ ]:조건과 위치(숫자)기반, .iloc[ ]:오롯이 숫자기반

In [51]:
# 행에서 0번 행과 2행 추출,  열은 모두
print('컬럼 위치 기반 인덱싱 데이터 추출')
print(titanic_df.iloc[[0,2],:])
print()

# 행에서 0번 행과, 열에서 Pclass 열만
print('컬럼명 기반 인덱싱 데이터 추출 : ', end="")
print(titanic_df.loc[0,'Pclass'])

컬럼 위치 기반 인덱싱 데이터 추출
   PassengerId  Survived  Pclass                     Name     Sex   Age  \
0            1         0       3  Braund, Mr. Owen Harris    male  22.0
2            3         1       3   Heikkinen, Miss. Laina  female  26.0

   SibSp  Parch            Ticket   Fare Cabin Embarked
0      1      0         A/5 21171  7.250   NaN        S
2      0      0  STON/O2. 3101282  7.925   NaN        S

컬럼명 기반 인덱싱 데이터 추출 : 3

In [52]:
# loc  iloc  사용 예를 보기 위한 데이터 생성
# 딕셔너리 생성 후 데이터 프레임으로 변환
data = {'Name' : ['Chunlmin','Eunkyung','Jinwoong', 'Soobeon'],
        'Year' : [2011, 2016, 2015, 2015],
        'Gender' : ['Male','Female','Male','Male']
       }
data_df = pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one    Chunlmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeon  2015    Male

In [55]:
# 인덱스와 컬럼명을 동시 활용한 필터링(loc)
print("\n loc['one','Name']", data_df.loc['one','Name'])
print("\n loc['two','Gender']", data_df.loc['two','Gender'])
print("\n loc['three','Name']", data_df.loc['three','Year'])

 loc['one','Name'] Chunlmin

 loc['two','Gender'] Female

 loc['three','Name'] 2015

In [56]:
# 인덱스 번호와 컬럼 번호를 이용한 필터링(iloc)
print("\n iloc[0:2,[0,1]]\n", data_df.iloc[0:2,[0,1]])
print("\n iloc[0:2,0:3]\n", data_df.iloc[0:2,0:3])

 iloc[0:2,[0,1]]
          Name  Year
one  Chunlmin  2011
two  Eunkyung  2016

 iloc[0:2,0:3]
          Name  Year  Gender
one  Chunlmin  2011    Male
two  Eunkyung  2016  Female

In [57]:
# loc, iloc를 이용한 전체를 표현한 예
print("\n loc[:] \n", data_df.loc[:])
print("\n loc[:, :] \n", data_df.loc[:, :])
print("\n iloc[:] \n", data_df.iloc[:])
print("\n iloc[:, :] \n", data_df.iloc[:, :])

 loc[:]
            Name  Year  Gender
one    Chunlmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeon  2015    Male

 loc[:, :]
            Name  Year  Gender
one    Chunlmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeon  2015    Male

 iloc[:]
            Name  Year  Gender
one    Chunlmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeon  2015    Male

 iloc[:, :]
            Name  Year  Gender
one    Chunlmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeon  2015    Male

In [58]:
# 조건
print("\n loc[data_df['Year']>=2014] \n", data_df.loc[data_df.Year >= 2014])
# .loc 생략가능
# data_df.loc[data_df.Year >= 2014]  data_df.loc[data_df['Year']>=2014]
# data_df.Year 와 data_df['Year'] 는 같은 표현입니다
# 컬럼 이름 중간에 공백이 있을 때 이 때는 data_df['Year'] 이 형식을 반드시 사용해야 합니다

 loc[data_df['Year']>=2014]
            Name  Year  Gender
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeon  2015    Male

In [63]:
# data_df를 reset_index()로 새로운 숫자형 인덱스를 생성합니다
data_df_reset = data_df.reset_index()
# 기존 인덱스가 데이터로 포함될 때 컬럼명을 지정할 수 있습니다
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})
# index 값에 1을 더해서 1부터 시작하는 새로운 index값을 생성할 수도 있습니다
data_df_reset.index = data_df_reset.index + 1

# 아래 코드는 오류를 발생합니다
# data_df_reset.loc[1,1]  에러
# loc에서 인덱스의 사용은 행을 단독으로 사용할 때 허용되곤 합니다.
# 인덱스는 iloc에서만 사용하는 것이 좋습니다
# 올바른 예
print(data_df_reset.iloc[1,1])
print()
print(data_df_reset.loc[0:2])
print()
print(data_df_reset.loc[2])
# data_df_reset.loc[1,1] 에러

Eunkyung

  old_index      Name  Year  Gender
1       one  Chunlmin  2011    Male
2       two  Eunkyung  2016  Female

old_index         two
Name         Eunkyung
Year             2016
Gender         Female
Name: 2, dtype: object

In [64]:
# 아래 코드는 오류를 발생합니다. - iloc는 인덱스 전용 도구입니다
data_df.iloc[0, 'Name']
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [65]:
# 올바른 예
data_df.iloc[0,1]

2011

### 불린 인덱싱(Boolean indexing)
* 헷갈리는 위치기반, 명칭기반 인덱싱을 사용할 필요없이 조건식을 [ ]안에 기입하여 간편하게 필터링을 수행

In [67]:
# titanic_df['Age'] > 60
var1 = titanic_df['Age'] > 60
print(type(var1))
print(var1)

<class 'pandas.core.series.Series'>
0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [68]:
# .loc 생략
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[ titanic_df['Age']>60]
titanic_boolean.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S

In [76]:
# 나이가 60이 넘는 승객의 이름만 필터링
titanic_df[ titanic_df['Age'] > 60 ]['Name'].head()

33              Wheadon, Mr. Edward H
54     Ostby, Mr. Engelhart Cornelius
96          Goldschmidt, Mr. George B
116              Connors, Mr. Patrick
170         Van der hoef, Mr. Wyckoff
Name: Name, dtype: object

In [77]:
# 나이가 60이 넘는 승객의 이름과 나이 필터링
titanic_df[ titanic_df['Age']>60 ][ ['Name','Age'] ].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

### GroupBy & 함수

In [78]:
# 숫자로 된 컬럼에 대한 데이터 건수
# NaN값은 count에서 제외됩니다
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [79]:
# 특정 컬럼들로 함수 수행
titanic_df['Age'].mean()
# ['Age']가 없으면 숫자로 된 모든 컬럼에 대해 평균값을 계산합니다
# titanic_df.mean() : 숫자로 된 모든 컬럼에 대한 평균값

29.69911764705882

In [82]:
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [83]:
titanic_df[['Age','Fare']].mean(axis=0)
# axis=0이면 age, fare 각각의 값이 구해짐(열 단위)

Age     29.699118
Fare    32.204208
dtype: float64

In [84]:
titanic_df[['Age','Fare']].mean(axis=1)
# axis=1이면 age, fare의 평균이 구해짐(행 단위)

0      14.62500
1      54.64165
2      16.96250
3      44.05000
4      21.52500
         ...
886    20.00000
887    24.50000
888    23.45000
889    28.00000
890    19.87500
Length: 891, dtype: float64

In [85]:
titanic_df[['Age', 'Fare']].sum(axis=0)

Age     21205.1700
Fare    28693.9493
dtype: float64

### groupby()
* groupby 인자에 Group by 하려는 컬럼을 입력합니다
* 그룹이 생성된 곳에서 여러 개의 컬럼으로 Group by로 특정 정보를 얻고자 시도하면 [ ]내에 해당 컬럼명을 입력합니다
* DataFrame에 groupby( )를 호출하면 DataFrameGroupBy객체를 리턴합니다

In [5]:
import pandas as pd
titanic_df = pd.read_csv('titanic_train.csv')
# by에 입력된 Pclass의 구성 값들로 그룹이 만들어집니다.
titanic_groupby = titanic_df.groupby(by='Pclass')
# 현재는 그룹만 구성을 하고 아무일도 안한 상태이므로 titanic_groupby를 출력해도
# 결과는 Object(객체) 형태로 출력됩니다
print(titanic_groupby)
print(type(titanic_groupby))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001AEE6AC5970>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [6]:
# 객체상태에서는 아무 정보를 얻어낼 수가 없습니다
# 그룹객체를 대상으로한 함수 실행 등으로 필요한 정보를 얻어냅니다
# DataFrameGroupBy 객체에 함수를 호출하여 Groupby를 수행합니다
titanic_groupby = titanic_df.groupby('Pclass').mean()
titanic_groupby

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [7]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [8]:
print(titanic_groupby.shape)
print(titanic_groupby.index)

(3, 11)
Int64Index([1, 2, 3], dtype='int64', name='Pclass')

# "선실등급별 Age의 평균과 생존률" 만
titanic_groupby = titanic_df.groupby(by='Pclass')[['Age','Survived']].mean()
titanic_groupby

In [13]:
# "선실등급별 생존자의 인원수"
titanic_groupby = titanic_df.groupby(by='Pclass')['Survived'].sum()
titanic_groupby

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

### 판다스는 여러 종류의 함수를 동시 적용할 수 있도록 agg()함수를 별도로 제공합니다

In [14]:
# Pclass별 인원수, 생존자 수, 생존율
tg = titanic_df.groupby('Pclass')['Survived'].agg(['count','sum','mean'])
tg

        count  sum      mean
Pclass
1         216  136  0.629630
2         184   87  0.472826
3         491  119  0.242363

### Missing 데이터 처리
DataFrame의 isna()메소드는 모든 컬럼값들이 NaN인지 확인하여 True/False을 반환합니다(NaN이면 True)

In [16]:
# 아래의 둘은 같은 기능을 갖는 함수입니다
titanic_df.isnull()
titanic_df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

#### 아래와 같이 isna() 반환 결과에 sum()을 호출하여 컬럼별로 NaN건수를 구할 수 있습니다

In [17]:
# True - 1, False - 0
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### fillna()로 Missing 데이터 대체하기 **

In [18]:
# Cabin 컬럼의 결측치를 C000으로 대체
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [19]:
# Age는 결측치가 아닌 데이터들의 평균으로
# Embarked는 그냥 'S'라는 문자값으로 대체
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### apply lambda식으로 데이터 가공
파이썬 lambda식 기본

In [21]:
# 일반적 함수의 사용
def get_square(a):
    return a**2

print('3의 제곱은 : ', get_square(3))

3의 제곱은 :  9

In [23]:
# 람다를 이용한 함수정의와 사용
lambda_square = lambda x : x ** 2

print('3의 제곱은 : ', lambda_square(3))

3의 제곱은 :  9

### 판다스에 apply lambda식 적용 **

In [25]:
# 새로운 값 또는 기존 컬럼값에 연산한 결과로 새로운 필드를 만들어내는 형식
titanic_df['Age_10'] = titanic_df['Age'] + 10
titanic_df[['Age','Age_10']].head(2)

    Age  Age_10
0  22.0    32.0
1  38.0    48.0

In [26]:
# 연산식 : 람다 함수식
# 실행 : 연산식을 apply 함수에 넣어 실행
# 아래는 탑승자 이름의 글자 개수를 카운트에서 Name_Len 컬럼을 생성하여 저장
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']].head(2)

# name_count = lambda x : len(x)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51

### Apply Lambda에 if적용
* Age를 기준으로 15세 이하 Child, 나머지 Adult로 표시 컬럼명 Age_2Level

In [27]:
titanic_df['Age_2level'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else 'Adult')
titanic_df[['Age','Age_2level']].head(10)

         Age Age_2level
0  22.000000      Adult
1  38.000000      Adult
2  26.000000      Adult
3  35.000000      Adult
4  35.000000      Adult
5  29.699118      Adult
6  54.000000      Adult
7   2.000000      Child
8  27.000000      Adult
9  14.000000      Child

In [28]:
titanic_df['Age_3level'] = titanic_df['Age'].apply(\
    lambda x : 'Child' if x<=15 else ('Adult' if x <=55 else 'Elderly')
    )
titanic_df[['Age','Age_3level']].head(20)

          Age Age_3level
0   22.000000      Adult
1   38.000000      Adult
2   26.000000      Adult
3   35.000000      Adult
4   35.000000      Adult
5   29.699118      Adult
6   54.000000      Adult
7    2.000000      Child
8   27.000000      Adult
9   14.000000      Child
10   4.000000      Child
11  58.000000    Elderly
12  20.000000      Adult
13  39.000000      Adult
14  14.000000      Child
15  55.000000      Adult
16   2.000000      Child
17  29.699118      Adult
18  31.000000      Adult
19  29.699118      Adult

### 연습문제
* Age별로
* 0~12 : 어린이
* 13~18 : 청소년
* 19~55: 성년
* 56~ : 노년
* 위와 같이 나눈 컬럼(Age_4level)을 만들고
* 레벨별 인원, 생존자, 생존율을 화면에 출력하시오

In [50]:
titanic_df['Age_4level'] = titanic_df['Age'].apply(lambda x : '어린이' if x<=12 else ('청소년' if x <=18 else \
   ('성년' if x <=55 else '노년')))
tg=titanic_df.groupby('Age_4level')['Survived'].agg(['count','sum','mean'])
tg.columns=['탑승자수','생존자수','생존율(%)']
# 소수점 둘째 자리에서 반올림하는 연산
tg['생존율(%)']=(tg['생존율(%)'] * 1000).round() / 10
tg

            탑승자수  생존자수  생존율(%)
Age_4level
노년            40    12    30.0
성년           712   260    36.5
어린이           69    40    58.0
청소년           70    30    42.9